/* ---------- headers */

#include "game/game_options.h"

/* ---------- constants */

/* ---------- definitions */

/*
struct s_main_game_globals
{
    e_map_memory_configuration map_memory_configuration; // 0x0
    long game_loaded_status; // 0x4
    char game_loaded_scenario_path[260]; // 0x8
    bool map_reset_in_progress; // 0x10C
    bool map_advance_pending; // 0x10D
    bool map_change_pending; // 0x10E
    bool map_change_pending_unload; // 0x10F
    unsigned long map_change_initiate_time; // 0x110
    unsigned long map_change_timer; // 0x114
    game_options pending_game_options; // 0x118
    bool load_core_on_game_launch; // 0xD418
    char core_name[255]; // 0xD419
    long launch_player_count; // 0xD518
    char pad[4]; // 0xD51C
    game_options launch_game_options; // 0xD520
};
static_assert(sizeof(s_main_game_globals) == 0x1A820);
*/

/* ---------- prototypes */

/* ---------- globals */

/* ---------- private variables */

static
{
    //extern s_main_game_globals main_game_globals;
}

/* ---------- public code */

/* ---------- private code */
